Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItem.MaterialName Property
 Material name
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string MaterialName { get; }
Public ReadOnly Property MaterialName As String
	Get
Property Value
Type: String
See Also
Reference
MaterialMarketSizesItem Class
Tekla.Structures.Catalogs Namespace